#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.flyte_db_password: Refreshing state... [id=none]
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
google_service_account.flyte_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_service_account.user_code_service_account: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
google_project_iam_custom_role.flyte_backend_role: Refreshing state... [id=projects/exemplary-tide-379122/roles/flyteBackendRole]
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
google_container_cluster.flyte_cluster: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
data.google_client_config.default: Reading...
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_project_iam_member.user_code_role_member: Refreshing state... [id=exemplary-tide-379122/roles/editor/serviceAccount:user-code-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
data.google_client_config.default: Read complete after 1s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
google_project_iam_binding.flyte_backend_role_binding: Refreshing state... [id=exemplary-tide-379122/projects/exemplary-tide-379122/roles/flyteBackendRole]
google_container_node_pool.flyte_nodepool: Refreshing state... [id=projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster/nodePools/flyte-node-pool]
google_sql_database_instance.flyte_db_backend: Refreshing state... [id=flyte-db-backend]
google_sql_user.flyte_db_user: Refreshing state... [id=postgres//flyte-db-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_container_cluster.flyte_cluster must be replaced
-/+ resource "google_container_cluster" "flyte_cluster" {
      ~ cluster_ipv4_cidr           = "10.12.0.0/14" -> (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      - enable_autopilot            = false -> null
      ~ enable_intranode_visibility = false -> (known after apply)
      - enable_tpu                  = false -> null
      ~ endpoint                    = "35.185.67.199" -> (known after apply)
      ~ id                          = "projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster" -> (known after apply)
      ~ label_fingerprint           = "a9dc16a7" -> (known after apply)
      ~ logging_service             = "logging.googleapis.com/kubernetes" -> (known after apply)
      ~ master_version              = "1.26.5-gke.1200" -> (known after apply)
      ~ monitoring_service          = "monitoring.googleapis.com/kubernetes" -> (known after apply)
        name                        = "flyte-cluster"
      ~ network                     = "projects/exemplary-tide-379122/global/networks/default" -> "default"
      ~ networking_mode             = "ROUTES" -> (known after apply)
      ~ node_locations              = [
          - "us-east1-b",
          - "us-east1-c",
          - "us-east1-d",
        ] -> (known after apply)
      ~ node_version                = "1.26.5-gke.1200" -> (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      ~ project                     = "exemplary-tide-379122" -> (known after apply)
      - resource_labels             = {} -> null
      ~ self_link                   = "https://container.googleapis.com/v1/projects/exemplary-tide-379122/locations/us-east1/clusters/flyte-cluster" -> (known after apply)
      ~ services_ipv4_cidr          = "10.15.240.0/20" -> (known after apply)
      ~ subnetwork                  = "projects/exemplary-tide-379122/regions/us-east1/subnetworks/default" -> (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
        # (8 unchanged attributes hidden)

      - addons_config {
          - gce_persistent_disk_csi_driver_config {
              - enabled = true -> null
            }
          - network_policy_config {
              - disabled = true -> null
            }
        }

      - binary_authorization {
          - enabled = false -> null
        }

      - cluster_autoscaling {
          - enabled = false -> null
        }

      - database_encryption {
          - state = "DECRYPTED" -> null
        }

      - default_snat_status {
          - disabled = false -> null
        }

      + ip_allocation_policy { # forces replacement
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = (known after apply)
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = (known after apply)
          + stack_type                    = "IPV4" # forces replacement
        }

      - logging_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
              - "WORKLOADS",
            ] -> null
        }

      ~ master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          ~ cluster_ca_certificate = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUVMVENDQXBXZ0F3SUJBZ0lSQU9VMDZVY0IyTlorLzZGbVNuSlpoWDR3RFFZSktvWklodmNOQVFFTEJRQXcKTHpFdE1Dc0dBMVVFQXhNa01qQmxOV0ZqWXpNdE56ZzRNUzAwTmpjMkxXRTBaalF0WW1FNFlXWTRNRGhrTkRNMgpNQ0FYRFRJek1EY3hNVEUwTVRjeU5sb1lEekl3TlRNd056QXpNVFV4TnpJMldqQXZNUzB3S3dZRFZRUURFeVF5Ck1HVTFZV05qTXkwM09EZ3hMVFEyTnpZdFlUUm1OQzFpWVRoaFpqZ3dPR1EwTXpZd2dnR2lNQTBHQ1NxR1NJYjMKRFFFQkFRVUFBNElCandBd2dnR0tBb0lCZ1FEejkrNVJvMExKY1U4L3VFZTZ6TXpWeGFiYlBkVEFJelEwY2xIRgo3RTdLaFZ3ZjZoWDk4ckJwM1ZqcThXSjZHOVBOMm9sTzhsQUVWU1dYblJCTUx3Nzc1M3VNMW9QM1ZUWEQ2MFdTClhodis4bmYxcENLY0JHUmV5QkVVNWk3VGVwMVZnNTJlYzFtOWJMWGNOdWNXOEEwQVh2S29zc1l4b2VBc2lVdkYKWWZ1ZUR0eUhieEFFSUhjSy9OTncxWXRZTzY2VjZLSDF2MjZOMENiOWg3SWtzZDdOTlZ5TGJNTGRycFIyS3FnNQp6RnVCamE2TFU1NWdwQ3BjbmFmQUpDNTRYM0JJV3hNWThxZG8veFZGMlpOK2NteVZPSUcrak9jTnpFeDFzRGlNCklPblhGMzZ6V05MakFESUR2VEMzWTg5U1U5SzhlODJuaHBubzE5RHZtaTVzUWREQmpPa3Z0WUUzTDVaV0pKWHQKSXl6alRPSnRQeVpPejcyWXRhdVdRL2xvQXRtZnplUDVDVE5HcHhmb1puUVdRQ0ZIaGI3MFI0UkZOOWR2KzQ3OQo4TStvNHZUZmErdndoYnlCVVFSeExlQmpzTlRLTlp4RzloTzgzQVJIbGt4MWo3alRTc3MxaURuSjZRd0tiRFRBCkZaNkxSN1Y1QXFROTNqNHc5bmYrWnltZmsya0NBd0VBQWFOQ01FQXdEZ1lEVlIwUEFRSC9CQVFEQWdJRU1BOEcKQTFVZEV3RUIvd1FGTUFNQkFmOHdIUVlEVlIwT0JCWUVGRmtYbUdSRi9RRkVWY3gyUkNXL1BVclNOUGNoTUEwRwpDU3FHU0liM0RRRUJDd1VBQTRJQmdRRFlGb29ldWVsYXhwSG5Za0tHZ2RNNzh1aVErcnVma2pyYjRLREcvWkdsCk9sbUE5VStleUJVS3o1QTBGb0xTWlhnM1YwRnVsVHk4ZFpFSzBDRDZHOUg5R2xvK1hpK3I1bjd5TlFkNE84bkgKU25tOXV2SkVKSWw3c0UvZmNuR2YyS0d2SlJVNUlLNkF3WkFVUWZ5QUdnZ21iaVJBQVBwWEk0Tm84RHNERzZyQgptLzJNN0lSZjJxRVBqOUN0RlhwVlVZa1VzREZmSS9sUHc2dFNXMFBWWXgxTlFQSkpIdHdVd2d0aWg4QWt3ZnlQCnhQeVBNZ2Vmeld3Y0Q2a1RCVkhSRjhxOWRCR3R4MGJPeGM3UXNobEw5UmMrbmE4bjh1SWx5ZFRHV2Y2cmFua3QKdHI1ZTB6a3VFZ0JPTjNLWS9ISzBNb3NDQ2lLa3hDdjh1SU9vcDRjSkVGeC9xaVMwa09OdzlBUDltK0lqdnJzKwpDU2FXOHlvMU1keHJhYTRrWmtieTh0UDY3YTRFN3dvWWc3a0htMnpscFNVOGRxb3ZvSmhRVnRsbWdzdW92c0ZMCjRCL3pQNDFlb2lteDhoOW5XNUxsVFNqc0Y4aUVtU1lRRm9lMTA0MTNHV2U3WmdVWW1pd0FpRmZZSzZXc2NHUGcKN1YvYUNGZFlzT2ZLa2FkS1RKejh6NUE9Ci0tLS0tRU5EIENFUlRJRklDQVRFLS0tLS0K" -> (known after apply)

            # (1 unchanged block hidden)
        }

      - monitoring_config {
          - enable_components = [
              - "SYSTEM_COMPONENTS",
            ] -> null
        }

      - network_policy {
          - enabled  = false -> null
          - provider = "PROVIDER_UNSPECIFIED" -> null
        }

      + node_config { # forces replacement
          + disk_size_gb      = 10 # forces replacement
          + disk_type         = "pd-balanced" # forces replacement
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = false # forces replacement
          + service_account   = (known after apply)
          + spot              = false # forces replacement
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config { # forces replacement
              + local_ssd_count = 0 # forces replacement
            }
        }

      - node_pool_defaults {
          - node_config_defaults {
              - logging_variant = "DEFAULT" -> null
            }
        }

      - notification_config {
          - pubsub {
              - enabled = false -> null
            }
        }

      - private_cluster_config {
          - enable_private_endpoint = false -> null
          - enable_private_nodes    = false -> null
          - private_endpoint        = "10.142.0.2" -> null
          - public_endpoint         = "35.185.67.199" -> null

          - master_global_access_config {
              - enabled = false -> null
            }
        }

      - release_channel {
          - channel = "REGULAR" -> null
        }

      - security_posture_config {
          - mode               = "MODE_UNSPECIFIED" -> null
          - vulnerability_mode = "VULNERABILITY_MODE_UNSPECIFIED" -> null
        }

      - service_external_ips_config {
          - enabled = false -> null
        }
    }

  # google_container_node_pool.flyte_nodepool will be created
  + resource "google_container_node_pool" "flyte_nodepool" {
      + cluster                     = "flyte-cluster"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-east1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "flyte-node-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = "pd-balanced"
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-micro"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = "flyte-sa@exemplary-tide-379122.iam.gserviceaccount.com"
          + spot              = false
          + taint             = (known after apply)

          + ephemeral_storage_local_ssd_config {
              + local_ssd_count = 0
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*